УправлениеПаркомАттракционов/src/Documents/РегистрацияЗатрат/РегистрацияЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияЗатрат</name>
  <registerRecords>AccumulationRegister.ПрочиеЗатраты</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаФОТ</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаСодержаниеАттракционов</registerRecords>
  <tabularSections>
    <name>СодержаниеАттракционов</name>
    <attributes>
      <name>Аттракцион</name>
      <type>
        <types>CatalogRef.Аттракционы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗатратыНаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрочиеЗатраты</name>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправлениеПаркомАттракционов/src/AccumulationRegisters/ПрочиеЗатраты/ПрочиеЗатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПрочиеЗатраты</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УправлениеПаркомАттракционов/src/AccumulationRegisters/ЗатратыНаФОТ/ЗатратыНаФОТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗатратыНаФОТ</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УправлениеПаркомАттракционов/src/AccumulationRegisters/ЗатратыНаСодержаниеАттракционов/ЗатратыНаСодержаниеАттракционов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗатратыНаСодержаниеАттракционов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Аттракцион</name>
    <type>
      <types>CatalogRef.Аттракционы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УправлениеПаркомАттракционов/src/Documents/РегистрацияЗатрат/ObjectModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ПрочиеЗатраты.Записывать = Истина;
	Движения.ЗатратыНаФОТ.Записывать = Истина;
	Движения.ЗатратыНаСодержаниеАттракционов.Записывать = Истина;
	
	// регистр ПрочиеЗатраты
	Для Каждого ТекСтрокаСодержаниеАттракционов из СодержаниеАттракционов Цикл
		Движение = Движения.ПрочиеЗатраты.Добавить();
		Движение.Период = Дата;
		Движение.СтатьяЗатрат = ТекСтрокаСодержаниеАттракционов.СтатьяЗатрат;
		Движение.Сумма = ТекСтрокаСодержаниеАттракционов.Сумма;
	КонецЦикла;

	// регистр ЗатратыНаФОТ	
	Для Каждого ТекСтрокаЗатратыНаСотрудников из ЗатратыНаСотрудников Цикл		
		ДвижениеЗатратыНаФОТ = Движения.ЗатратыНаФОТ.Добавить();
		ДвижениеЗатратыНаФОТ.Период = Дата;
		ДвижениеЗатратыНаФОТ.Сотрудник = ТекСтрокаЗатратыНаСотрудников.Сотрудник;
		ДвижениеЗатратыНаФОТ.СтатьяЗатрат = ТекСтрокаЗатратыНаСотрудников.СтатьяЗатрат;
		ДвижениеЗатратыНаФОТ.Сумма = ТекСтрокаЗатратыНаСотрудников.Сумма;		
	КонецЦикла;

	// регистр ЗатратыНаСодержаниеАттракционов	
	Для Каждого ТекСтрокаСодержаниеАттракционов из СодержаниеАттракционов Цикл
		ДвижениеЗатратыНаАттракционы = Движения.ЗатратыНаСодержаниеАттракционов.Добавить();
		ДвижениеЗатратыНаАттракционы.Период = Дата;
		ДвижениеЗатратыНаАттракционы.Аттракцион = ТекСтрокаСодержаниеАттракционов.Аттракцион;
		ДвижениеЗатратыНаАттракционы.СтатьяЗатрат = ТекСтрокаСодержаниеАттракционов.СтатьяЗатрат;
		ДвижениеЗатратыНаАттракционы.Сумма = ТекСтрокаСодержаниеАттракционов.Сумма;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
